# Question 0

In [1]:
import pandas as pd
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)

"""
Write a function that takes dataframe df (defined above) and string with animal as inputs and returns rows 
where animal is equal to string (parameter function) and age is less than 3.

Notes:
        - Return empty DataFrame if wrong animal is written
"""

In [2]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [3]:
def filter_animals(df,animal):
    my_filter = (df['animal'] == animal) & (df['age'] < 3)
    return df[my_filter]

In [6]:
filter_animals(df, 'cat')

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

# Q1

In [75]:
import pandas as pd
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)

"""
Write a function that takes dataframe df (defined above) as input and returns filtered dataframe with:
        - Only numeric columns
        - Only rows without any missing values

Notes:
        - Donâ€™t select the columns and rows manually (use filtering)
"""

In [78]:
def filter_dataframe(df):
    
    myColumns = []
    
    for i in range(0, len(df.dtypes)):
        if (df.dtypes[i] != object):
            myColumns.append(df.dtypes.index[i])
    
    df_new = df[myColumns]
    
    for col in myColumns:
        df_new2 = df_new[~df_new[col].isnull()]
        break
    
    return df_new2

In [64]:
df_new = df[filter_dataframe(df)]
df_new[~df_new['age'].isnull()]

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
e  5.0       2
f  2.0       3
g  4.5       1
i  7.0       2
j  3.0       1

In [79]:
filter_dataframe(df)

reached here

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
e  5.0       2
f  2.0       3
g  4.5       1
i  7.0       2
j  3.0       1

In [38]:
df.dtypes

animal       object
age         float64
visits        int64
priority     object
dtype: object

In [60]:
df_new.iloc[3,0] == np.nan

False

In [58]:
np.nan

nan

In [19]:
df.columns

Index(['animal', 'age', 'visits', 'priority'], dtype='object')

# Q3

In [80]:
import pandas as pd
import numpy as np

#Create a Dictionary of series
d = {'Name':pd.Series(['Andres','James','David','Vin','Steve','David','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)

In [ ]:
"""
Write a function that takes df (defined above) as input and returns tuple with 3 values:
   - Most common name (string)
   - Average age (float)
   - IQR of rating (float)

Notes:
   - Average age and IQR must be float not numpy.float64 type
"""

In [100]:
def compute_statistics(df):
    t1 = df['Name'].value_counts()[0]
    t2 = df['Age'].mean()
    
    q1 = df['Rating'].quantile(0.25)
    q3 = df['Rating'].quantile(0.75)

    iqr = q3 - q1
    t3 = iqr
    
    final_tuple = (t1, float(t2), float(t3))
    
    return final_tuple

In [102]:
type(compute_statistics(df)[1])

float

In [85]:
df

      Name  Age  Rating
0   Andres   25    4.23
1    James   26    3.24
2    David   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    David   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [91]:
df.groupby('Name').count().sort_values(by='Age', ascending=False)

        Age  Rating
Name
David     3       3
Andres    2       2
Betina    1       1
Gasper    1       1
Jack      1       1
James     1       1
Lee       1       1
Steve     1       1
Vin       1       1

In [96]:
df['Age'].mean()

31.833333333333332

In [94]:
df['Name'].value_counts()

David     3
Andres    2
Betina    1
Lee       1
Vin       1
Jack      1
Gasper    1
James     1
Steve     1
Name: Name, dtype: int64

# Q4